# ADSK_Группирование = имя файла
# В квадратных скобках ADSK_Позиция экземпляра семейства

#_функциональная составляющая оборудования
#Port_Di = 1
#Port_Do = 2
#Port_Ai = 0
#Port_Ao = 0
#Port_RS = 0
#Port_Eth = 0

#_отображение на структурной схеме (типовые аннотаци)
#Symbol = Имя экземпляра типовой аннотации
#Level = Уровень на структурной схеме (0, 1 ,2,3)
#FormatSxema = Горизонтальное или вертикальное размещение элементов внутри цепи (Hor, Ver)
#OrientationMarka = Ориентация марки на структурной схеме (Hor, Ver)
#FormatGrowing = Определяет рост цепей относительного этого элемента (Rigth, Up)
#HaveMarkAlways =Определяет наличие марки для каждого элемента внутри цепи (Yes, No) На первом элементе всегда будет марка.


[BSU]
Port_Di = 0
Port_Do = 8
Port_Ai = 0
Port_Ao = 0
Port_RS = 2
Port_Eth = 0
Symbol = Шкаф
Level = 0
FormatSxema = Hor
OrientationMarka = Hor
FormatGrowing = Up
HaveMarkAlways = No

[BMP8]
Port_Di = 0
Port_Do = 8
Port_Ai = 0
Port_Ao = 0
Port_RS = 1
Port_Eth = 0
Symbol = Прямоугольный
Level = 1
FormatSxema = Hor
OrientationMarka = Hor
FormatGrowing = Right
HaveMarkAlways = Yes

[AI16]
Port_Di = 0
Port_Do = 2
Port_Ai = 16
Port_Ao = 0
Port_RS = 1
Port_Eth = 0
Symbol = Прямоугольный
Level = 1
FormatSxema = Hor
OrientationMarka = Hor
FormatGrowing = Right
HaveMarkAlways = Yes

[QE]
Port_Di = 1
Port_Do = 2
Port_Ai = 0
Port_Ao = 0
Port_RS = 0
Port_Eth = 0
Symbol = Окружность
Level = 1
FormatSxema = Ver
OrientationMarka = Hor
FormatGrowing = Right
HaveMarkAlways = Yes

[YA]
Port_Di = 1
Port_Do = 2
Port_Ai = 0
Port_Ao = 0
Port_RS = 0
Port_Eth = 0
Symbol = Свето-звуковой
Level = 2
FormatSxema = Ver
OrientationMarka = Ver
FormatGrowing = Right
HaveMarkAlways = Yes

[ЩА]
Port_Di = 1
Port_Do = 2
Port_Ai = 0
Port_Ao = 0
Port_RS = 0
Port_Eth = 0
Symbol = Прямоугольный
Level = 2
FormatSxema = Ver
OrientationMarka = Hor
FormatGrowing = Right
HaveMarkAlways = Yes